app/views/board/edit.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
 	<input name="authenticity_token" value="<%= form_authenticity_token %>" type="hidden">
  	<input name="id" value="<%= Post.find(params[:id]).id %>" type="hidden">