app/views/board/index.html.erb

<h2 align="center">게시판</h2><br/>
<% Post.all.each do |post| %>	<!-- %=면 , %면 내부적으로 처리 -->
---
SELECT "posts".* FROM "posts"