app/controllers/board_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "sdfas"], ["content", "adsfasd"], ["created_at", "2022-12-09 15:24:53.539877"], ["updated_at", "2022-12-09 15:24:53.539877"]]
---
  def create
	  title1 = params[:title]
	  content1 = params[:content]
	  Post.create(title: title1, content: content1)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "ewqr"], ["updated_at", "2022-12-09 15:30:20.930014"], ["id", 1]]
---
  def update
	  @post = Post.find(params[:id])
	  @post.title = params[:title]
	  @post.content = params[:content]
	  @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def delete
	  @post = Post.find(params[:id])
	  @post.destroy